Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
/**********************************************************************************************************************
* Copyright (c) 2014 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sd_util.c
* Version      : 3.01
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.09.2014 1.00    First Release
*              : 17.07.2015 1.10    Standardized by the combo.
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
*              : 10.02.2020 3.00    Added comment "WAIT_LOOP".
*                                   Added support for GNUC and ICCRX.
*              : 20.03.2025 3.01    Changed the disclaimer in program sources.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

#ifdef SDC_SD_CFG_LONGQ_ENABLE
#include "r_longq_if.h"
#endif /* SDC_SD_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static uint32_t g_sdc_sd_next = 0;      /* Volume ID Number */

#ifdef SDC_SD_CFG_LONGQ_ENABLE
static longq_hdl_t     p_sdc_sd_long_que = 0;
#endif /* SDC_SD_CFG_LONGQ_ENABLE */

static uint32_t g_sdc_sd_timer_cnt_out[SDC_SD_TIMER_CARD_MAX_NUM][SDC_SD_TIMER_CARD_MAX_COUNT + 1];

/**********************************************************************************************************************
* Outline      : Check Hardware Write Protect
* Function Name: r_sdc_sd_iswp
* Description  : Checks the hardware write protect using the SDHI register.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : 0                                      ;   WP pin = High (Non Write Protection)
*              : 1                                      ;   WP pin = Low  (Write Protection)
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_iswp(uint32_t card_no)
{
    sdc_sd_hndl_t  * p_hndl = 0;
    uint32_t            wp = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDHI_SUCCESS == R_SDHI_WPLayout(p_hndl->channel))
    {
        /*  Check the SDHI_SDSTS1 WP bit.  */
        R_SDHI_GetWP(p_hndl->channel, &wp);
    }
    else
    {
        wp = 0;
    }

    return wp;
} /* End of function r_sdc_sd_iswp() */

/**********************************************************************************************************************
* Outline      : Get Bit Information
* Function Name: r_sdc_sd_bit_search
* Description  : Checks the bits of argument (data) from LSB.
* Arguments    : uint32_t           data                ;   Checked data
* Return Value : -1                                     ;   no bit has 1'b
*              : other                                  ;   bit number has 1'b
*----------------------------------------------------------------------------------------------------------------------
* Notes        : All 16bits value can be applied.
**********************************************************************************************************************/
int32_t r_sdc_sd_bit_search(uint32_t data)
{
    int32_t i = 0;

    /* WAIT_LOOP */
    for (i = 15; 0 <= i; i--)
    {
        if (data & 1u)
        {
            return i;
        }
        data >>= SDC_SD_BIT_SHIFT_1;
    }

    return -1;
} /* End of function r_sdc_sd_bit_search() */

/**********************************************************************************************************************
* Outline      : Set Errors Information
* Function Name: r_sdc_sd_set_err
* Description  : Sets the error information (=error) to SD Handle member (=p_hndl->error).
* Arguments    : uint32_t               card_no         ;   SD Card No.
*              : sdc_sd_status_t      error             ;   Error information
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_set_err(uint32_t card_no, sdc_sd_status_t error)
{
    sdc_sd_hndl_t  * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDC_SD_SUCCESS == p_hndl->error)
    {
        p_hndl->error = error;
    }

