Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    p_sdc_sd_card_reg->sdio_ocr[0] = p_hndl->io_ocr[0];
#else
    p_sdc_sd_card_reg->sdio_ocr[0] = 0;
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO */
    p_sdc_sd_card_reg->ocr[0] = p_hndl->ocr[0];
    p_sdc_sd_card_reg->dsr[0] = p_hndl->dsr[0];
    
    /* WAIT_LOOP */
    for (i = 0; i < 2; ++i)
    {
        p_sdc_sd_card_reg->rca[i] = p_hndl->rca[i];
        p_sdc_sd_card_reg->scr[i] = p_hndl->scr[i];
    }
    /* WAIT_LOOP */
    for (i = 0; i < 4; ++i)
    {
        p_sdc_sd_card_reg->cid[i] = p_hndl->cid[i];
        p_sdc_sd_card_reg->csd[i] = p_hndl->csd[i];
        p_sdc_sd_card_reg->sdstatus[i] = p_hndl->sdstatus[i];
    }
    /* WAIT_LOOP */
    for (i = 0; i < 5; ++i)
    {
        p_sdc_sd_card_reg->switch_func_status[i] = p_hndl->status_data[i];
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_GetCardInfo() */

/**********************************************************************************************************************
* Outline      : Get Card Size
* Function Name: r_sdc_sd_get_size
* Description  : Gets the memory card size.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            area                ;   Memory area (bit0:user area, bit1:protect area)
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_get_size(uint32_t card_no, uint32_t area)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint32_t            c_mult = 0;
    uint32_t            c_size = 0;
    uint32_t            read_bl_len = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- READ BL LEN ---- */
    read_bl_len = ((p_hndl->csd[1] & SDC_SD_CSD_READ_BL_LEN) >> SDC_SD_BIT_SHIFT_16);
    /* ---- C_SIZE_MULT ---- */
    c_mult = ((p_hndl->csd[2] & SDC_SD_CSD_C_SIZE_MULT) >> SDC_SD_BIT_SHIFT_15);

    if (area & SDC_SD_PROT_AREA)
    {
        /* Calculate the number of all sectors. */
        if (SDC_SD_CSD_STR_VER_2_0 <= p_hndl->csd_structure)
        {
            p_hndl->prot_sector_size = (p_hndl->sdstatus[1]) / SDC_SD_TRANS_BLOCK_SIZE;
        }
        else
        {
            p_hndl->prot_sector_size = ((p_hndl->sdstatus[1] * ((uint32_t)1 << (c_mult + 2))) *
                                        ((uint32_t)1 << read_bl_len)) / SDC_SD_TRANS_BLOCK_SIZE;
        }
    }

    if (area & SDC_SD_USER_AREA)
    {
        if (SDC_SD_CSD_STR_VER_2_0 <= p_hndl->csd_structure)
        {
            c_size = ((p_hndl->csd[1] & SDC_SD_CSD_2_0_C_SIZE_UPPER) << SDC_SD_BIT_SHIFT_16);
            c_size = (c_size | ((p_hndl->csd[2] & SDC_SD_CSD_2_0_C_SIZE_LOWER) >> SDC_SD_BIT_SHIFT_16));
            /* Memory capacity = C_SIZE*SDC_SD_TRANS_BLOCK_SIZE Kbyte */
            /* Sector_size = memory capacity/SDC_SD_TRANS_BLOCK_SIZE */
            p_hndl->card_sector_size = ((c_size + 1) << SDC_SD_BIT_SHIFT_10);
        }
        else
        {
            /* ---- C_SIZE ---- */
            c_size = ((p_hndl->csd[1] & SDC_SD_CSD_1_0_C_SIZE_UPPER) << SDC_SD_BIT_SHIFT_2);
            c_size = (c_size | ((p_hndl->csd[2] & SDC_SD_CSD_1_0_C_SIZE_LOWER) >> SDC_SD_BIT_SHIFT_30));
            /* Calculate the number of all sectors. */
            p_hndl->card_sector_size = (((uint32_t)(c_size + 1) * ((uint32_t)1 << (c_mult + 2))) *
                                        ((uint32_t)1 << read_bl_len)) / SDC_SD_TRANS_BLOCK_SIZE;
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_get_size() */

/**********************************************************************************************************************
* Outline      : Get SD Driver Errors
* Function Name: r_sdc_sd_GetErrCode
* Description  : Gets the SD Driver errors (=p_hndl->error) and returns it
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : Error code                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_GetErrCode(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;  /* Not initialized */
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    return p_hndl->error;
} /* End of function r_sdc_sd_GetErrCode() */

/**********************************************************************************************************************
* Outline      : Control SDHI driver
* Function Name: r_sdc_sd_Control
* Description  : Controls the SDHI driver using the specified command.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : sdc_sd_cmd_t         * p_sdc_sd_cmd    ;   Command
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_Control(uint32_t card_no, sdc_sd_cmd_t * p_sdc_sd_cmd)
{
    sdc_sd_hndl_t  * p_hndl = 0;
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    uint8_t         tmp_io_flag = 0;
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDC_SD_ERR;  /* Not initialized */
    }

    /* ---- Check the card is mounted. ---- */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)
    if (SDC_SD_MOUNT_UNLOCKED_CARD != p_hndl->mount)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    tmp_io_flag = p_hndl->io_flag & (SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT);
    if ((SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT) != tmp_io_flag)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */

    /*  Check the parameter.  */
    if (0 == (uint32_t)p_sdc_sd_cmd)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    switch (p_sdc_sd_cmd->cmd)
    {
        case SDC_SD_SET_STOP:  /* Stop the operation compulsory. */
            p_hndl->stop = 1;
        break;

        default:
            /* NOP */
        break;
    }

