Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_Control() */

/**********************************************************************************************************************
* Outline      : Set Memory
* Function Name: r_sdc_sdmemset
* Description  : Sets memory to the specified data of the specified size from start address.
* Arguments    : uint8_t            * p_ptr             ;   Start address of memory
*              : uint8_t            data                ;   Filling data
*              : uint32_t           cnt                 ;   Filling size
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmemset(uint8_t * p_ptr, uint8_t data, uint32_t cnt)
{
    /* WAIT_LOOP */
    while (cnt--)
    {
        *p_ptr++ = data;
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmemset() */

/**********************************************************************************************************************
* Outline      : Copy Memory
* Function Name: r_sdc_sdmemcpy
* Description  : Copies data of the specified size from the specified source address to the specified destination address.
* Arguments    : uint8_t            * p_dst             ;   Destination address
*              : uint8_t            * p_src             ;   Source address
*              : uint32_t           cnt                 ;   Copy size
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmemcpy(uint8_t * p_dst, uint8_t * p_src, uint32_t cnt)
{
    /* WAIT_LOOP */
    while (cnt--)
    {
        *p_dst++ = *p_src++;
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmemcpy() */

/**********************************************************************************************************************
* Outline      : Create Volume ID Number
* Function Name: r_sdc_sd_rand
* Description  : Gets the Volume ID Number. The Volume ID number is created by pseudo random number.
* Arguments    : None
* Return Value : uint32_t                               ;   Created Volume ID Number
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_rand(void)
{
    g_sdc_sd_next = (g_sdc_sd_next * 1103515245L) + 12345;

    return (uint32_t)g_sdc_sd_next;
} /* End of function r_sdc_sd_rand() */

/**********************************************************************************************************************
* Outline      : Set Volume ID Number
* Function Name: r_sdc_sd_srand
* Description  : Sets the initial value of Volume ID Number
* Arguments    : uint32_t           seed                ;   Initial setting value
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
void r_sdc_sd_srand(uint32_t seed)
{
    if (0 == g_sdc_sd_next)
    {
        g_sdc_sd_next = seed;
    }

    return;
} /* End of function r_sdc_sd_srand() */

/**********************************************************************************************************************
* Outline      : Wait for Busy End
* Function Name: r_sdc_sd_wait_rbusy
* Description  : Waits for busy end.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           time                ;   Busy wait interval
* Return Value : SDC_SD_SUCCESS                         ;   Busy finished
*              : SDC_SD_ERR                             ;   Busy
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_wait_rbusy(uint32_t card_no, uint32_t time)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint32_t               i = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* WAIT_LOOP */
    for (i = 0; i < time; ++i) 
    {
        if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) == SDC_SD_SUCCESS)
        {
            if (SDC_SD_STATE_TRAN == (p_hndl->resp_status & SDC_SD_RES_STATE))  /* Transfer state */
            {
                return SDC_SD_SUCCESS;
            }
        }
        else    /* SDHI error */
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
            break;
        }
        if (R_SDC_SD_GetCardDetection(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
            break;
        }
        r_sdc_sd_wait(card_no, 1);
    }

    r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);

    return SDC_SD_ERR;
} /* End of function r_sdc_sd_wait_rbusy() */

/**********************************************************************************************************************
* Outline      : Get Buffer Register Address
* Function Name: r_sdc_sd_GetBuffRegAddress
* Description  : Gets the Buffer Register Address.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           * p_reg_buff        ;   Buffer Register Address
* Return Value : SDC_SD_SUCCES                          ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_GetBuffRegAddress(uint32_t card_no, uint32_t * p_reg_buff)
{
    sdc_sd_hndl_t * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDC_SD_ERR;  /* Not initialized */
    }

    /*  Check the parameter.  */
    if (0 == p_reg_buff)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    if (R_SDHI_GetBuffRegAddress(p_hndl->channel, p_reg_buff) != SDHI_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }

