Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
    num = (num + 3);
    num = (num / 4);

    if ((uint32_t)p_buff & 0x3)
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
#if (SDC_SD_BIG_ENDIAN)
            tmp = *p_reg;
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
            *p_buff++ = (uint8_t)tmp;
#else
            tmp = *p_reg;
            *p_buff++ = (uint8_t)tmp;
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
#endif
        }
    }
    else
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
            *p_ptr++ = *p_reg;
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_read_data() */

/**********************************************************************************************************************
* Outline      : Write to SD Card
* Function Name: r_sdc_sd_write_data
* Description  : Writes the sector data to the data register.
* Arguments    : uint8_t            * p_buff            ;   Write data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_write_data(uint8_t * p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t * p_reg = (uint32_t *)(reg_addr);
    uint32_t * p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;

    num = (num + 3);
    num = (num / 4);

    if ((uint32_t)p_buff & 0x3)
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
#if (SDC_SD_BIG_ENDIAN)
            tmp = (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
            tmp = (tmp | (uint32_t)(*p_buff++));
            *p_reg = tmp;
#else
            tmp = (uint32_t)(*p_buff++);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24));
            *p_reg = tmp;
#endif
        }
    }
    else
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
            *p_reg = *p_ptr++;
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_write_data() */

/**********************************************************************************************************************
* Outline      : Read from SD Card
* Function Name: r_sdc_sd_read_data_byte
* Description  : Reads the byte data from the data register.
* Arguments    : uint8_t            * p_buff            ;   Read data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_read_data_byte(uint8_t * p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t * p_reg = (uint32_t *)(reg_addr);
    uint32_t * p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;
    int32_t  franc = 0;

    franc = (num & 0x03);
    num   = (num / 4);

    if (0 != num)
    {
        if ((uint32_t)p_buff & 0x3)
        {
            /* WAIT_LOOP */
            for (i = num ; i > 0 ; i--)
            {
#if (SDC_SD_BIG_ENDIAN)
                tmp = *p_reg;
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
                *p_buff++ = (uint8_t)tmp;
#else
                tmp = *p_reg;
                *p_buff++ = (uint8_t)tmp;
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
                *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
#endif
            }
        }
        else
        {
            /* WAIT_LOOP */
            for (i = num ; i > 0 ; i--)
            {
                *p_ptr++ = *p_reg;
                p_buff += 4;
            }
        }
    }

    if (0 != franc)
    {
        tmp = *p_reg;
        if (1 == franc)
        {
#if (SDC_SD_BIG_ENDIAN)
            *p_buff = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
#else
            *p_buff = (uint8_t)tmp;
#endif
        }
        else if (2 == franc)
        {
#if (SDC_SD_BIG_ENDIAN)
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
            *p_buff   = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
#else
            *p_buff++ = (uint8_t)tmp;
            *p_buff   = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
#endif
        }
        else
        {
#if (SDC_SD_BIG_ENDIAN)
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_24);
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
            *p_buff   = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
#else
            *p_buff++ = (uint8_t)tmp;
            *p_buff++ = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_8);
            *p_buff   = (uint8_t)(tmp >> SDC_SD_BIT_SHIFT_16);
#endif
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_read_data_byte() */

/**********************************************************************************************************************
* Outline      : Write to SD Card
* Function Name: r_sdc_sd_write_data_byte
* Description  : Writes the byte data to the data register.
* Arguments    : uint8_t            * p_buff            ;   Write data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_write_data_byte(uint8_t * p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t * p_reg = (uint32_t *)(reg_addr);
    uint32_t * p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;
    int32_t  franc = 0;

    franc = (num & 0x03);
    num   = (num / 4);

    if (0 != num)
    {
        if ((uint32_t)p_buff & 0x3)
        {
            /* WAIT_LOOP */
            for (i = num ; i > 0 ; i--)
            {
#if (SDC_SD_BIG_ENDIAN)
                tmp = (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24);
                tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
                tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
                tmp = (tmp | (uint32_t)(*p_buff++));
                *p_reg = tmp;
#else
                tmp = (uint32_t)(*p_buff++);
                tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
                tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
                tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24));
                *p_reg = tmp;
#endif
            }
        }
        else
        {
            /* WAIT_LOOP */
            for (i = num ; i > 0 ; i--)
            {
                *p_reg = *p_ptr++;
                p_buff += 4;
            }
        }
    }

    if (0 != franc)
    {
        if (1 == franc)
        {
#if (SDC_SD_BIG_ENDIAN)
            tmp = (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24);
#else
            tmp = (uint32_t)(*p_buff++);
#endif
        }
        else if (2 == franc)
        {
#if (SDC_SD_BIG_ENDIAN)
            tmp = (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
#else
            tmp = (uint32_t)(*p_buff++);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
#endif
        }
        else
        {
#if (SDC_SD_BIG_ENDIAN)
            tmp = (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_24);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
#else
            tmp = (uint32_t)(*p_buff++);
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_8));
            tmp = (tmp | (uint32_t)((*p_buff++) << SDC_SD_BIT_SHIFT_16));
#endif
        }
        *p_reg = tmp;
    }

