Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_write_data_byte() */

/**********************************************************************************************************************
* Outline      : Set DMAC/DTC transfer End Flag
* Function Name: r_sdc_sd_SetDmacDtcTransFlg
* Description  : Sets DMAC/DTC transfer end flag.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           flg                 ;   Transfer: 1  No transfer: 0 
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_SetDmacDtcTransFlg(uint32_t card_no, uint32_t flg)
{
    g_sdc_sd_int_dmacdtcflg[card_no] = flg;

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_SetDmacDtcTransFlg() */

/**********************************************************************************************************************
* Outline      : SDHI 1ms Interval
* Function Name: r_sdc_sd_1msInterval
* Description  : 1ms Interval Timer call function.
* Arguments    : None
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
void r_sdc_sd_1msInterval(void)
{
    uint32_t card_no = 0;

    /* WAIT_LOOP */
    for (card_no = 0; card_no < SDC_SD_TIMER_CARD_MAX_NUM; card_no++)
    {
        if (0 != g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_FLG])
        {
            g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_COUNT]++;
        }
    }
    return;
} /* End of function r_sdc_sd_1msInterval() */

/**********************************************************************************************************************
* Outline      : SDHI Start timer for timeout
* Function Name: r_sdc_sd_start_timer
* Description  : Set timer for checking timeout and start timer.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           msec                ;   timeout(msec order)
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_start_timer(uint32_t card_no, uint32_t msec)
{
    if (SDC_SD_TIMER_CARD_MAX_NUM <= card_no)
    {
        return SDC_SD_ERR;
    }

    /* ---- Check argument ---- */
    if ((0 >= msec) || (msec > 0x0fffffff))
    {
        return SDC_SD_ERR;
    }
    g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_FLG] = 1;
    g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_COUNT] = 0;
    g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_MAX_COUNT] = (uint32_t)(msec);

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_start_timer() */

/**********************************************************************************************************************
* Outline      : SDHI Check timeout
* Function Name: r_sdc_sd_check_timer
* Description  : Check timeout set r_sdc_sd_start_timer function.
*              : If timeout,return SDC_SD_ERR.In the case of others, return SDC_SD_SUCCESS.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           msec                ;   timeout(msec order)
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_check_timer(uint32_t card_no)
{
    sdc_sd_status_t ret = SDC_SD_SUCCESS;

    /* ---- Check compare ---- */
    if (g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_COUNT] >= 
        g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_MAX_COUNT])
    {
        ret = SDC_SD_ERR;
    }
    else
    {
        ret = SDC_SD_SUCCESS;
    }

    return ret;
} /* End of function r_sdc_sd_check_timer() */

/**********************************************************************************************************************
* Outline      : SDHI End timer for timeout
* Function Name: r_sdc_sd_end_timer
* Description  : End timer set r_sdc_sd_start_timer function.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
void r_sdc_sd_end_timer(uint32_t card_no)
{

    g_sdc_sd_timer_cnt_out[card_no][SDC_SD_TIMER_CARD_FLG] = 0;

    return;
} /* End of function r_sdc_sd_end_timer() */

/**********************************************************************************************************************
* Outline      : SDHI API Lock
* Function Name: r_sdc_sd_api_lock
* Description  : Attempts to acquire the lock that has been sent in.
* Arguments    : int32_t    * p_lock                    ;   Pointer to SDHI API lock.
* Return Value : true                                   ;   Lock was acquired.
*              : false                                  ;   Lock was not acquired.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdc_sd_api_lock(int32_t * p_lock)
{
#if ((SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) && (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO))
    bool ret = false;

    /* Variable used in trying to acquire lock. Using the xchg instruction makes this atomic */
    int32_t is_locked = true;

    /* Try to acquire semaphore to obtain lock */
    R_BSP_EXCHANGE(&is_locked, p_lock);

    /* Check to see if semaphore was successfully taken */
    if (is_locked == false)
    {
        /* Lock obtained, return success. */
        ret = true;
    }
    else
    {
        /* Lock was not obtained, another task already has it. */
    }

    return ret;
#else
    return true;
#endif /* ((SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) && (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)) */
} /* End of function r_sdc_sd_api_lock() */

/**********************************************************************************************************************
* Outline      : SDHI API UnLock
* Function Name: r_sdc_sd_api_unlock
* Description  : Releases hold on lock.
* Arguments    : int32_t    * p_lock                    ;   Pointer to SDHI API lock.
* Return Value : true                                   ;   Lock was released.
*              : false                                  ;   Lock was not released.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdc_sd_api_unlock(int32_t * p_lock)
{
#if ((SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) && (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO))
   /* Set lock back to unlocked. */
    *p_lock = false;

    return true;
#else
    return true;
#endif /* ((SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) && (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)) */
} /* End of function r_sdc_sd_api_unlock() */

/* End of File */
